Table of Contents
 Class BoltParam
Namespace
IdeaRS.OpenModel.Parameters
Assembly
IdeaRS.OpenModel.dll
Parameter which represts the record of the bolt in IDEA MPRL
[DataContract]
[Serializable]
public class BoltParam : MprlRecord
Inheritance
object
MprlRecord
BoltParam
Derived
AnchorParam
Inherited Members
 MprlRecord.Name
 MprlRecord.TableId
 MprlRecord.ItemId
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Angles
Gets or sets the groups and positions for angles.
[DataMember]
public NumberGroups Angles { get; set; }
Property Value
NumberGroups
 BoltInteraction
Indicates type of shear transfer
[DataMember]
public BoltShearType BoltInteraction { get; set; }
Property Value
BoltShearType
 Cols
Gets or sets the columns of fasteners positions.
[DataMember]
public NumberGroups Cols { get; set; }
Property Value
NumberGroups
 ColsGridType
Gets or sets the type of cols - regular or shifted.
[DataMember]
public ConnectorGridType ColsGridType { get; set; }
Property Value
ConnectorGridType
 ColsNegative
Gets or sets the rows of a negative fasteners positions in case of RowsPosition equals to Profile. Absolute positions of groups, in group are relative positions.
[DataMember]
public NumberGroups ColsNegative { get; set; }
Property Value
NumberGroups
 ColsPosition
Gets or sets the position, to which are bolt columns realted to.
[DataMember]
public PositionRelatedTo ColsPosition { get; set; }
Property Value
PositionRelatedTo
 ColsSymmetry
Gets or sets the type of symmetry of columns positions.
[DataMember]
public Symmetry ColsSymmetry { get; set; }
Property Value
Symmetry
 CoordinateSystem
Gets or sets the coordinate system type.
[DataMember]
public CoordinateSystemMethod CoordinateSystem { get; set; }
Property Value
CoordinateSystemMethod
 Counts
Gets or sets the count of bolts in the circle (polar coordinate system).
[DataMember]
public IList<int> Counts { get; set; }
Property Value
IList<int>
 PolarInput
Gets or sets the type, that spefifies polar input.
[DataMember]
public PolarInputType PolarInput { get; set; }
Property Value
PolarInputType
 PolarPosition
Gets or sets the position, to which are bolt radii realted to (polar coordinate system).
[DataMember]
public PositionRelatedTo PolarPosition { get; set; }
Property Value
PositionRelatedTo
 Positions
Gets or sets the fasteners positions {X, Y}.
[DataMember]
public List<Point> Positions { get; set; }
Property Value
List<Point>
 Radii
Gets or sets the radii of bolts (polar coordinate system).
[DataMember]
public NumberGroups Radii { get; set; }
Property Value
NumberGroups
 Rows
Gets or sets the rows of a fasteners positions. Absolute positions of groups, in group are relative positions.
[DataMember]
public NumberGroups Rows { get; set; }
Property Value
NumberGroups
 RowsGridType
Gets or sets the type of rows - regular or shifted.
[DataMember]
public ConnectorGridType RowsGridType { get; set; }
Property Value
ConnectorGridType
 RowsNegative
Gets or sets the rows of a negative fasteners positions in case of RowsPosition equals to Profile. Absolute positions of groups, in group are relative positions.
[DataMember]
public NumberGroups RowsNegative { get; set; }
Property Value
NumberGroups
 RowsPosition
Gets or sets the position, to which are bolt rows realted to.
[DataMember]
public PositionRelatedTo RowsPosition { get; set; }
Property Value
PositionRelatedTo
 RowsSymmetry
Gets or sets the type of symmetry of rows positions.
[DataMember]
public Symmetry RowsSymmetry { get; set; }
Property Value
Symmetry
 ShearInThread
Indicates, whether a shear plane is in the thread of a bolt.
[DataMember]
public bool ShearInThread { get; set; }
Property Value
bool
 Edit this page